example/rails_app/app/api/v1/products.rb

      def find_product!
        Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1

      end
      post do
        product = Product.new(params.slice(:name, :price, :stock, :description, :category_id, :active))
        if product.save
---
INSERT INTO "products" ("name", "description", "price", "stock", "category", "active", "created_at", "updated_at") VALUES ('Test Product', NULL, 29.99, 50, 'Electronics', 1, '2026-06-14 20:07:59.148001', '2026-06-14 20:07:59.148001') RETURNING "id"

        requires :id, type: Integer, desc: "Product ID"
      end
      delete ":id" do
        find_product!.destroy!
---
DELETE FROM "products" WHERE "products"."id" = 1